

const initialState = {
    content: [
        {
            main: 'Что такое ЗИД',
            desc: 'Одно из крупнейших предприятий в оборонном и машиностроительном комплексе России с более чем 100-летней историей. Наш завод - современное многопрофильное, динамично развивающееся предприятие, имеющее высокий промышленный, производственный, научно-технический и кадровый потенциал. В настоящее время предприятие выпускает не только самое современное вооружение, но и широкую гамму продукции гражданского назначения: мототехнику, минисельхозтехнику и навесное оборудование к ней, упаковочные автоматы для пищевой промышленности и светодиодную продукцию. Продукция с маркой «ЗИД» экспортируется в десятки стран мира, с успехом демонстрируется на крупнейших всероссийских и международных выставках и ярмарках.',
            image: 'https://i.ibb.co/jhRhPnZ/eb-Q6-BJU5-Fdc.jpg',
            descImage: 'Центральные проходные'
        },
        {
            main: 'Что такое целевое обучение',
            desc: 'Это программа в вузах и колледжах (то есть, как высшего, так и среднего профессионального образования), при которой студент обучается за счет работодателя, который заинтересован в специалисте этого профиля. Специфика целевого набора в том, что студент учится бесплатно, но после окончания учебного заведения должен по договору отработать не меньше 3-х лет в той организации, которая направила его на обучение.',
            image: 'https://i.ibb.co/kD3SMpN/section2image2.jpg',
            descImage: 'Студент КГТА Иван Акишкин'
        },
        {
            main: 'Кто такой инженер',
            desc: 'Специалист, осуществляющий инженерную деятельность. Инженеры вовлечены, как правило, во все процессы жизненного цикла технических устройств, являющихся предметом инженерного дела, включая прикладные исследования, планирование, проектирование, конструирование, разработку технологии изготовления (сооружения), подготовку технической документации, производство, наладку, испытание, эксплуатацию, техническое обслуживание, ремонт, утилизацию устройства и управление качеством.',
            image: 'https://i.ibb.co/CKhQvz3/2-Ee-Bxgp-B6s4.jpg',
            descImage: 'Работник предприятия'
        },
    ]
}

const reducerSection3 = (state = initialState, action = {}) => {
    switch(action.type){
        
        default:
            return state;
    }
}


export default reducerSection3;