

const initialState = {
    content: [
        {
            title: 'Корд 12,7 мм пулемет на станке с сошками 6Т19',
            text: 'Предназначен для борьбы с легкобронированными наземными целями, транспортными средствами, и групповыми живыми целями на дальностях до 2000 м, а также может быть использован для борьбы с низколетящими воздушными целями на наклонных дальностях до 1500 м.',
            img: 'https://i.ibb.co/7R6BFXB/q5tw4l1231231239-Wcws.jpg',
            url: 'https://www.youtube.com/watch?v=VKDcqEjpa4A&feature=emb_logo&ab_channel=videozid',
        },
        {
            title: 'Ручной противотанковый гранатомет РПГ-7В2',
            text: 'В основу гранатомета положена схема безоткатного пускового устройствамногоразового применения и выстрела с надкалиберной боевой частью. Гранатомет имеет уширение ствола в его средней части — зарядную камеру — для более полного использования энергии метательного заряда, и раструб в казеннойчасти — для обеспечения безоткатности комплекса. Кроме механического прицела, гранатомет имеет оптический прицел.',
            img: 'https://i.ibb.co/pwwqdbM/img-6064-231.jpg',
            url: '',
        },
        {
            title: 'Мотоцикл YX250GY-C5C',
            text: 'Флагманская модель из современной линейки мотоциклов «ЗИД». Быстрый и мощный «эндуро» выдерживает агрессивный стиль вождения не только на ровной дороге, но и на умеренном бездорожье. Мотоцикл имеет яркий дизайн, оптимальные хода подвески и вилки, оснащен мощным двигателем объемом 223 куб. см, а также передними и задними дисковыми тормозами.',
            img: 'https://i.ibb.co/cYV5DWd/bez-imeni-5.jpg',
            url: 'https://www.youtube.com/watch?v=dK3RvNwoNM8&feature=emb_logo&ab_channel=videozid',
        },
        {
            title: '9 мм пистолет-пулемет АЕК 919К «КАШТАН»',
            text: 'Предназначен для подавления и поражения живой силы противника на дальностях до 100 м. Применяются для вооружения специальных подразделений, выполняющих боевые задачи и обеспечивающих поражение и подавление живой силы.',
            img: 'https://i.ibb.co/58FvR6n/img-0460-292.jpg',
            url: 'https://www.youtube.com/watch?v=sd-BcKNAItc&feature=emb_logo',
        },
    ]
}

const reducerSection8 = (state = initialState, action = {}) => {

    switch(action.type){
        default:{
            return state;
        }
    }
}

export default reducerSection8